// SPA (Single Page Application | Одностраничное приложение) - Это веб-приложение, которое загружается один раз и динамически обновляет контент без полной загрузки сайта.

// +
// 1. Быстрая навигация по сайту после загрузки.
// 2. Меньше нагрузки на сервер.
// 3. Хороший пользовательский опыт.(UX)

// -
// 1. Проблемы с SEO.
// 2. Долгая первая загрузка приложения.
// 3. Возможны проблемы с безопасностью.

// SSR ( Server Side Rendering | Рендеринг на стороне сервера) - Это метод рендеринга, при котором HTML-код страницы генерируется и отправляется клиенту уже в готовом виде.

// +
// 1. Хорошая SEO оптимизация.
// 2. Быстрая первая загрузка страницы.
// 3. Контент доступен даже без подключенного JavaScript.

// -
// 1. Повышенная нагрузка на сервер.
// 2. Медленнее чем SPA после первой загрузки.
// 3. Возможны задержки на слабых серверах.

// SSG ( Static Site Generation | Генерация статических сайтов) - Это метод, при котором страницы создаются/генерируются заранее (до запроса пользователя)
// и хранятся в статическом виде на сервере.

// +
// 1. Мгновенная загрузка.
// 2. Отличная поддержка SEO.
// 3. Минимальная нагрузка на сервер.

// -
// 1. Не подходит для часто изменяющихся данных.
// 2. Ограниченная динамичность.
// 3. Не подходит для больших проектов.

// React - это библитека для создания пользовательских интерфейсов.
// В разработке react приложения используется компонентный подход.

// Компонента jsx - это функция, которая возвращает jsx разметку.  