// Формат JSX - это синтаксис который позволяет писать HTML-подобный код внутри JS. Чаще всего используется в библиотеке react.js и делает код более читаемым и удобным для написания.

// const element = <h1>React App</h1>
// const element = React.createElement('h1', null, 'React App')

// JSX требует, чтобы внутри разметки был только один корневой элемент

// В случае если нам нужно чтобы элементы находились на одном уровне, можно использовать фрагменты.

// Синтаксис фрагментов: <></> || <Fragment></Fragment>

